# StructuralAttachmentEndLevelReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAttachmentEndLevelReference Property
ParameterTypeId Class See Also
---
"End Attachment Level Reference"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAttachmentEndLevelReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAttachmentEndLevelReference As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAttachmentEndLevelReference {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace